INSERT INTO users(name, phone_number) VALUES('user1', '01012345678');

INSERT INTO notification(user_id, idempotency_key, status, retry_count, phone_number, title, contents, reserved_at, retry_at, created_at)
VALUES
    (1, 'idempotency-key1', 'SENT', 0, '01012345678', '알림 제목1', '알림 내용1', '2025-10-02T23:00:00', '2025-10-02T23:00:00', '2025-10-02T22:00:00'),
    (1, 'idempotency-key2', 'SENT', 0, '01012345678', '알림 제목2', '알림 내용2', '2025-10-02T23:10:00', '2025-10-02T23:10:00', '2025-10-02T23:00:00'),
    (1, 'idempotency-key3', 'SENT', 0, '01012345678', '알림 제목3', '알림 내용3', '2025-10-02T23:20:00', '2025-10-02T23:20:00', '2025-10-02T23:10:00'),
    (1, 'idempotency-key4', 'RESERVED', 0, '01012345678', '알림 제목4', '알림 내용4', '2025-10-03T10:00:00', '2025-10-03T10:00:00', '2025-10-03T09:00:00'),
    (1, 'idempotency-key5', 'RESERVED', 0, '01012345678', '알림 제목5', '알림 내용5', '2025-10-03T11:00:00', '2025-10-03T11:00:00', '2025-10-03T10:00:00'),
    (1, 'idempotency-key6', 'RESERVED', 0, '01012345678', '알림 제목6', '알림 내용6', '2025-10-03T12:00:00', '2025-10-03T12:00:00', '2025-10-03T11:50:00'),
    (1, 'idempotency-key7', 'RESERVED', 0, '01012345678', '알림 제목7', '알림 내용7', '2025-10-04T12:30:00', '2025-10-04T12:30:00', '2025-10-04T12:00:00'),
    (1, 'idempotency-key8', 'CANCELED', 0, '01012345678', '알림 제목8', '알림 내용8', '2025-10-04T12:40:00', '2025-10-04T12:40:00', '2025-10-04T12:30:00'),
    (1, 'idempotency-key9', 'CANCELED', 1, '01012345678', '알림 제목9', '알림 내용9', '2025-10-04T12:50:00', '2025-10-04T12:50:01', '2025-10-04T12:40:00'),
    (1, 'idempotency-key10', 'RESERVED', 1, '01012345678', '알림 제목10', '알림 내용10', '2025-10-04T15:15:15', '2025-10-04T15:15:16', '2025-10-05T14:15:15')